[ { "title": "Home", "content": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n\n \n \n \n Marlin Firmware\n Open Source 3D Printer Driver\n First created in 2011 for RepRap and Ultimaker by Erik van der Zalm, today Marlin drives most of the world's 3D printers. Reliable and precise, Marlin delivers outstanding print quality while keeping you in full control of the process.\n As an Open Source project hosted on Github, Marlin is owned and maintained by the maker community. Learn how you can contribute!\n \n \n \n &nbsp; Learn more\n \n &nbsp; Download\n \n \n \n\n\n\n \n \n{% for feature in site.data.features %}\n \n \n \n \n \n {{ feature.title }}\n \n \n \n \n \n \n{% endfor %}\n \n \n\n\n\n", "link": "/", "excerpt": "Marlin, the most widely-used 3D printer firmware in the world", "search_omit": "" } ,{ "title": "G0 G1 : Linear Move", "content": "The G0 and G1 commands add a linear move to the queue to be performed after all previous moves are completed. These commands yield control back to the command parser as soon as the move is queued, but they may delay the command parser while awaiting a slot in the queue.\n\nA linear move traces a straight line from one point to another, ensuring that the specified axes will arrive simultaneously at the given coordinates (by linear interpolation). The speed may change over time following an acceleration curve, according to the acceleration and jerk settings of the given axes.\n\nA command like G1 F1000 sets the feedrate for all subsequent moves.\n\nBy convention, most G-code generators use G0 for non-extrusion movements (those without the E axis) and G1 for moves that include extrusion. This is meant to allow a kinematic system to, optionally, do a more rapid uninterpolated movement requiring much less calculation.\n\nFor Cartesians and Deltas the G0 (rapid linear movement) command is (and must be) a direct alias for G1 (rapid movement). On SCARA machines G0 does a fast non-linear move. Marlin 2.0 introduces an option to maintain a separate default feedrate for G0. Note: Slicers tend to override firmware feedrates!\n", "excerpt": "Add a straight line movement to the planner", "link": "/docs/gcode/G000-G001.html", "search_omit": "" } ,{ "title": "G2 G3 : Controlled Arc Move", "content": "G2 adds a clockwise arc move to the planner; G3 adds a counter-clockwise arc. An arc move starts at the current position and ends at the given XYZ, pivoting around a center-point offset given by I and J or R.\n\nThis command has two forms:\nI J Form\n\n\n I specifies an X offset. J specifies a Y offset.\n At least one of the I J parameters is required.\n X and Y can be omitted to do a complete circle.\n The given X Y is not error-checked.\nThe arc ends based on the angle of the destination.\n Mixing I or J with R will throw an error.\n\n\nR Form\n\n R specifies the radius. X or Y is required.\n Omitting both X and Y will throw an error.\n X or Y must differ from the current XY position.\n Mixing R with I or J will throw an error.\n\n\nArc moves actually generate several short straight-line moves, the length of which are determined by the configuration option MM_PER_ARC_SEGMENT (default 1mm). Any change in the Z position is linearly interpolated over the whole arc.\n", "excerpt": "Add an arc movement to the planner", "link": "/docs/gcode/G002-G003.html", "search_omit": "" } ,{ "title": "G4 : Dwell", "content": "[“Dwell pauses the command queue and waits for a period of time.”]\n", "excerpt": "Pause the planner", "link": "/docs/gcode/G004.html", "search_omit": "" } ,{ "title": "G5 : Bézier cubic spline", "content": "G5 creates a cubic B-spline in the XY plane with the X and Y axes only. P and Q parameters are required. I and J are required for the first G5 command in a series. For subsequent G5 commands, either both I and J must be specified, or neither. If I and J are unspecified, the starting direction of the cubic will automatically match the ending direction of the previous cubic (as if I and J are the negation of the previous P and Q).\n\nSee This interactive demo to understand how Bézier control points work.\n", "excerpt": "Cubic B-spline with XYZE destination and IJPQ offsets", "link": "/docs/gcode/G005.html", "search_omit": "" } ,{ "title": "G10 : Retract", "content": "[“Retract the filament according to settings of M207.”, “Firmware retraction allows you to tune retraction at the machine level and can significantly reduce the size of G-code files.”, “Multiple consecutive G10 or G10 S1 commands without a corresponding G11 or G11 S1 will be ignored.”, “Performs two moves: a retract move at the retract feedrate/acceleration, and an optional Z lift at the maximum Z feedrate (travel acceleration).”]\n", "excerpt": "Retract the filament", "link": "/docs/gcode/G010.html", "search_omit": "" } ,{ "title": "G11 : Recover", "content": "[“Unretract (i.e., recover, prime) the filament according to settings of M208.”, “Multiple consecutive G11 or G11 S1 commands without a corresponding G10 or G10 S1 will be ignored.”, “Performs two moves: An optional Z lower at the maximum Z feedrate (travel acceleration), and a recovery move at the recover feedrate (retract acceleration).”]\n", "excerpt": "Recover the filament with firmware-based retract.", "link": "/docs/gcode/G011.html", "search_omit": "" } ,{ "title": "G12 : Clean the Nozzle", "content": "Start the nozzle cleaning process. Three types of cleaning patterns are supported: straight strokes, zigzags and circles. This feature requires a dedicated cleaning area on or outside the bed, but within reach of the nozzle. The pattern may be repeated as many times as desired.\n", "excerpt": "Perform the nozzle cleaning procedure.", "link": "/docs/gcode/G012.html", "search_omit": "" } ,{ "title": "G20 : Inch Units", "content": "[“Set units to inches. In this mode, all positions, offsets, rates, accelerations, etc., specified in G-code parameters are interpreted as inches.”]\n", "excerpt": "Set Units to Inches.", "link": "/docs/gcode/G020.html", "search_omit": "" } ,{ "title": "G21 : Millimeter Units", "content": "Set units to millimeters. In this mode, all positions, offsets, rates, accelerations, etc., specified in GCode parameters are interpreted as millimeters.\n", "excerpt": "Set Units to Millimeters.", "link": "/docs/gcode/G021.html", "search_omit": "" } ,{ "title": "G26 : Mesh Validation Pattern", "content": "[“G26 Mesh Validation Pattern is designed to be used in conjunction with mesh-based leveling to test the accuracy of the probed mesh.\\n\\nThe G26 command prints a single-layer pattern over the entire print bed, giving a clear indication of how accurately every mesh point is defined. G26 can be used to determine which areas of the mesh are less-than-perfect and how much to adjust each mesh point.\\n”]\n", "excerpt": "Test the mesh and adjust.", "link": "/docs/gcode/G026.html", "search_omit": "" } ,{ "title": "G27 : Park toolhead", "content": "Park the nozzle at a predefined XYZ position.\n", "excerpt": "Park the toolhead", "link": "/docs/gcode/G027.html", "search_omit": "" } ,{ "title": "G28 : Auto Home", "content": "[“Auto-home one or more axes, moving them towards their endstops until triggered. Each axis is backed off and re-bumped according to the [XYZ]_HOME_BUMP_MM and HOMING_BUMP_DIVISOR settings.”]\n", "excerpt": "Auto home one or more axes.", "link": "/docs/gcode/G028.html", "search_omit": "" } ,{ "title": "G29 : Bed Leveling (Automatic)", "content": "[“ABL probes the bed at 3 or more points and enables bed leveling compensation. The exact procedure and method depends on the type of bed leveling chosen in Configuration.h:\\n\\n* AUTO_BED_LEVELING_3POINT probes 3 points and uses a matrix to compensate for bed tilt.\\n* AUTO_BED_LEVELING_LINEAR also uses a tilt matrix but probes a grid and applies \"least-squares.\"\\n* AUTO_BED_LEVELING_BILINEAR probes a grid and produces a mesh to adjust Z across the bed.\\n”, “The printer must be homed with G28 before G29.\\n\\n* For AUTO_BED_LEVELING_UBL see G29 UBL and G26 Mesh Editing.\\n* For MESH_BED_LEVELING see the G29 MBL page.\\n”, “#### Automatic Probing\\n\\nWith an electronic probe Marlin can probe the entire bed in a matter of seconds —even before every print— with a single G29 command. Available parameters depend on the style of leveling. See parameter descriptions and examples below for details.\\n”, “#### Manual Probing\\n\\nAuto Bed Leveling now includes a PROBE_MANUALLY option for systems lacking a probe.\\n\\nPROBE_MANUALLY adds these parameters to G29:\\n- Q : Query leveling and G29 state\\n- A : Abort current leveling procedure\\n\\nTo do manual probing simply repeat G29 until the procedure is complete.\\n\\nThe first G29 accepts the same parameters , shown in the Usage section below. The exact parameters available will depend on which style of bed leveling is enabled. (Note:** UBL parameters are not covered on this page unless they coincide. See the G29 for UBL page for a full list of its options.)\\n\\nBefore probing the bed:\\n1. Use G29 Q to get the current status. If G29 isn’t idle, abort with G29 A.\\n2. Use M420 V to view leveling data. You can send M420 S1 to use the existing data.\\n\\nTo probe the bed using GCode:\\n1. Use G29 to move to the first point for Z adjustment.\\n2. Adjust Z so a piece of paper can just pass under the nozzle.\\n3. Use G29 to save the Z value and move to the next point.\\n4. Repeat steps 3-4 until completed.\\n5. Use M500 to save the leveling data to EEPROM, if desired.\\n\\nTo probe the bed using your LCD controller:** (Requires LCD_BED_LEVELING)\\n\\n1. Select the Level Bed sub-menu, then choose Level Bed (not Cancel).\\n2. Wait for Homing XYZ to complete.\\n3. When Click to Begin appears, press the controller button to move to the first point.\\n4. Use the controller wheel to adjust Z so that a piece of paper can just pass under the nozzle.\\n5. Press the controller button to save the Z value and move to the next point.\\n6. Repeat steps 4-5 until completed.\\n7. Use Control &gt; Store memory to save the mesh to EEPROM, if desired.\\n”, “#### Mesh Editing\\n\\nAUTO_BED_LEVELING_BILINEAR adds these parameters to G29 for editing mesh points:\\n- W Write a mesh point. (Ignored during leveling.)\\n- I X index for mesh point\\n- J Y index for mesh point\\n- X logical X of mesh point\\n- Y logical Y of mesh point\\n- Z Z to store in mesh. If omitted, current raw Z.\\n”]\n", "excerpt": "Probe the bed and enable leveling compensation.", "link": "/docs/gcode/G029-abl.html", "search_omit": "" } ,{ "title": "G29 : Bed Leveling (Manual)", "content": "[“Mesh Bed Leveling (MBL) allows interactively measuring a Z height mesh without a bed probe. The only tool required is a piece of paper or a feeler gauge. MBL uses the mesh to compensate for variations in height across the bed.\\n\\nMesh Bed Leveling from the host:\\n\\n1. Use G29 S0 to get the current status and mesh. If there’s an existing mesh, you can send M420 S1 to use it.\\n2. Use G29 S1 to move to the first point for Z adjustment.\\n3. Adjust Z so a piece of paper can just pass under the nozzle.\\n4. Use G29 S2 to save the Z value and move to the next point.\\n5. Repeat steps 3-4 until completed.\\n6. Use M500 to save the mesh to EEPROM, if desired.\\n\\nMesh Bed Leveling using an LCD controller: (Requires LCD_BED_LEVELING)\\n\\n1. Select Level Bed then choose Level Bed (not Cancel) in the sub-menu.\\n2. Wait for Homing XYZ to complete.\\n3. When Click to Begin appears, press the controller button to move to the first point.\\n4. Use the controller wheel to adjust Z so that a piece of paper can just pass under the nozzle.\\n5. Press the controller button to save the Z value and move to the next point.\\n6. Repeat steps 4-5 until completed.\\n7. Use Control &gt; Store memory to save the mesh to EEPROM, if desired.\\n”]\n", "excerpt": "Measure Z heights in a grid, enable leveling compensation", "link": "/docs/gcode/G029-mbl.html", "search_omit": "" } ,{ "title": "G29 : Bed Leveling (Unified)", "content": "[“The Unified Bed Leveling System (UBL) provides a comprehensive set of resources to produce the best bed leveling results possible.”, “See the full Unified Bed Leveling documentation for more details. (Examples below.)”]\n", "excerpt": "Probe the bed and enable leveling compensation.", "link": "/docs/gcode/G029-ubl.html", "search_omit": "" } ,{ "title": "G30 : Single Z-Probe", "content": "Do a single Z probe at a specified position. By default probe in the current position.\n", "excerpt": "Probe bed at current XY location", "link": "/docs/gcode/G030.html", "search_omit": "" } ,{ "title": "G31 : Dock Sled", "content": "Dock the Z probe sled.\n", "excerpt": "Dock the Z probe sled.", "link": "/docs/gcode/G031.html", "search_omit": "" } ,{ "title": "G32 : Undock Sled", "content": "Undock the Z probe sled.\n", "excerpt": "Undock the Z probe sled.", "link": "/docs/gcode/G032.html", "search_omit": "" } ,{ "title": "G33 : Delta Auto Calibration", "content": "With the G33 command you can:\n\n Probe a circular grid of points,\n Calibrate Delta Height,\n Calibrate endstops,\n Calibrate Delta Radius, and\n Calibrate Tower Angles.\n\n", "excerpt": "Calibrate various Delta parameters", "link": "/docs/gcode/G033.html", "search_omit": "" } ,{ "title": "G38.2 G38.3 : Probe target", "content": "[“The Probe Target commands are used to probe towards a workpiece and determine its precise position. The Z endstop doubles as the probe for these commands. You might, for example, use a grounded metal workpiece, with a metal probe spliced into the Z endstop circuit.\\n\\n- G38.2 probes towards a target and stops on contact, signaling an error if it reaches the target position without triggering the Z endstop.\\n- G38.3 probes towards a target and stops on contact. No error is given if it fails to trigger the Z endstop.\\n\\nThese commands use the current homing feedrate, by default.\\n”]\n", "excerpt": "Probe towards a workpiece and stop on contact.", "link": "/docs/gcode/G038.html", "search_omit": "" } ,{ "title": "G42 : Move to mesh coordinate", "content": "The G42 command moves the nozzle to the location corresponding to a specific coordinate in the bed leveling mesh. It operates similarly to the G0 and G1 commands except that the provided coordinates are a mesh row and column instead of an absolute or relative position on the bed.\n\nThe G42 command will determine the bed position that corresponds to the provided mesh row and column and move the nozzle to that position.\n", "excerpt": "Move to a specific point in the leveling mesh", "link": "/docs/gcode/G042.html", "search_omit": "" } ,{ "title": "G53 : Move in Machine Coordinates", "content": "G53 applies native workspace to the current move.\nIn CNC G-code G53 is a modifier. It precedes a movement command (or other modifiers) on the same line.\nMarlin also accepts G53 on a line by itself as the command to return to the native workspace.\n", "excerpt": "Apply native workspace to the current move.", "link": "/docs/gcode/G053.html", "search_omit": "" } ,{ "title": "G54 G55 G56 G57 G58 G59 G59.1 G59.2 G59.3 : Workspace Coordinate System", "content": "A workspace is an XYZ offset to the native machine space. All workspaces default to 0,0,0 at start, or with EEPROM support they may be restored from a previous session.\n\n “G92 is used to set the current workspace’s offset.”\n “G54 - use coordinate system 1”\n “G55 - use coordinate system 2”\n “G56 - use coordinate system 3”\n “G56 - use coordinate system 4”\n “G57 - use coordinate system 5”\n “G58 - use coordinate system 6”\n “G59 - use coordinate system 7”\n “G59.1 - use coordinate system 8”\n “G59.2 - use coordinate system 9”\n “G59.3 - use coordinate system 10”\n\n", "excerpt": "Select a workspace coordinate system", "link": "/docs/gcode/G054-059.html", "search_omit": "" } ,{ "title": "G90 : Absolute Positioning", "content": "[“In absolute mode all coordinates given in G-code are interpreted as positions in the logical coordinate space. This includes the extruder position unless overridden by M83.”]\n", "excerpt": "Use absolute positions.", "link": "/docs/gcode/G090.html", "search_omit": "" } ,{ "title": "G91 : Relative Positioning", "content": "[“Set relative position mode. In this mode all coordinates are interpreted as relative to the last position. This includes the extruder position unless overridden by M82.”]\n", "excerpt": "Use relative positions.", "link": "/docs/gcode/G091.html", "search_omit": "" } ,{ "title": "G92 : Set Position", "content": "[“Set the current position to the values specified. In Marlin 1.1.0 and up, the software endstops are adjusted to preserve the physical movement limits. Thus you could use G92 to set the middle of the bed to 0,0 and then run .gcode that was sliced for a Deltabot.”]\n", "excerpt": "Set the current position of one or more axes.", "link": "/docs/gcode/G092.html", "search_omit": "" } ,{ "title": "G425 : Perform auto-calibration", "content": "[“This command performs an automatic calibration of backlash, positional errors, and nozzle offset by touching the nozzle on the sides of a bed-mounted, electrically-conductive object (e.g., a cube, washer or bolt).”, “This command measures backlash but doesn’t enable backlash correction. Use M425 to enable backlash correction.”]\n", "excerpt": "Uses a calibration cube, washer or bolt for automatic calibration", "link": "/docs/gcode/G425.html", "search_omit": "" } ,{ "title": "M0 M1 : Unconditional stop", "content": "[“The M0 and M1 commands pause after the last movement and wait for the user to continue.”]\n", "excerpt": "Stop and wait for user.", "link": "/docs/gcode/M000-M001.html", "search_omit": "" } ,{ "title": "M3 : Spindle CW / Laser On", "content": "Wait for moves to complete, then set the spindle speed (clockwise) or laser power.\n", "excerpt": "Set the spindle CW speed or laser power", "link": "/docs/gcode/M003.html", "search_omit": "" } ,{ "title": "M4 : Spindle CCW / Laser On", "content": "Wait for moves to complete, then set the spindle speed (counter-clockwise) or laser power.\n", "excerpt": "Set the spindle CCW speed or laser power", "link": "/docs/gcode/M004.html", "search_omit": "" } ,{ "title": "M5 : Spindle / Laser Off", "content": "Wait for moves to complete, then turn off the spindle / laser power and PWM.\n", "excerpt": "Turn off spindle or laser", "link": "/docs/gcode/M005.html", "search_omit": "" } ,{ "title": "M17 : Enable Steppers", "content": "Enable power on all stepper motors.\n", "excerpt": "Power on all steppers", "link": "/docs/gcode/M017.html", "search_omit": "" } ,{ "title": "M18 M84 : Disable steppers", "content": "This command can be used to set the stepper inactivity timeout (S) or to disable one or more steppers (X,Y,Z,E).\n\nIf a timeout is given with S, this command just sets the stepper inactivity timeout.\n\nIf no steppers are specified, this command disables all steppers immediately.\n\nIf one or more axes are specified, this command disables the specified steppers immediately.\n", "excerpt": "Disable steppers (same as M84).", "link": "/docs/gcode/M018.html", "search_omit": "" } ,{ "title": "M20 : List SD Card", "content": "List the entire contents of the SD card to serial output in the more compact DOS 8.3 format.\n\nMarlin 1.1.0 includes file sizes in the output.\n", "excerpt": "List the contents of the SD Card.", "link": "/docs/gcode/M020.html", "search_omit": "" } ,{ "title": "M21 : Init SD card", "content": "Use this command if the SD card isn’t detected automatically.\n", "excerpt": "Attempt to detect an SD card in the slot.", "link": "/docs/gcode/M021.html", "search_omit": "" } ,{ "title": "M22 : Release SD card", "content": "If Marlin gets confused about the state of the SD card, this command can be used to simulate an ejection of the SD card.\n\nRe-insert the SD card or use M21 to enable the SD card following M22.\n", "excerpt": "Simulate ejection of the SD card", "link": "/docs/gcode/M022.html", "search_omit": "" } ,{ "title": "M23 : Select SD file", "content": "\n", "excerpt": "Select an SD file to be executed", "link": "/docs/gcode/M023.html", "search_omit": "" } ,{ "title": "M24 : Start or Resume SD print", "content": "Start an SD print or resume the paused SD print. If PARK_HEAD_ON_PAUSE is enabled, unpark the nozzle.\n\nIf POWER_LOSS_RECOVERY is enabled M24 accepts parameters which allow resuming the print from a specific point in the file. These parameters are usually only used in this scenario.\n", "excerpt": "Start or resume a file selected with `M23`", "link": "/docs/gcode/M024.html", "search_omit": "" } ,{ "title": "M25 : Pause SD print", "content": "Pause the SD print in progress. If PARK_HEAD_ON_PAUSE is enabled, park the nozzle.\n", "excerpt": "Pause printing from the SD card", "link": "/docs/gcode/M025.html", "search_omit": "" } ,{ "title": "M26 : Set SD position", "content": "Set the next read position in the open SD file.\n", "excerpt": "Set the SD read position", "link": "/docs/gcode/M026.html", "search_omit": "" } ,{ "title": "M27 : Report SD print status", "content": "[“With no parameter, report the current SD read position in the form \"SD printing byte 123/12345.\" If no file is open the response is \"Not SD printing.\"”, “With ‘S', set the SD status auto-report interval. (Requires `AUTO_REPORT_SD_STATUS`)\", \"With 'C', get the currently open file's name (and long filename if possible). Print \\\"`(no file)`\\\" if no file is open.\"]\n", "excerpt": "Print SD progress to serial", "link": "/docs/gcode/M027.html", "search_omit": "" } ,{ "title": "M28 : Start SD write", "content": "This command starts a file write. All commands received by Marlin are written to the file and are not executed until M29 closes the file.\n", "excerpt": "Start writing to a file on the SD card", "link": "/docs/gcode/M028.html", "search_omit": "" } ,{ "title": "M29 : Stop SD write", "content": "Stop writing to a file that was begun with M28 or M928. Logging is disabled.\n", "excerpt": "Stop writing the file, end logging.", "link": "/docs/gcode/M029.html", "search_omit": "" } ,{ "title": "M30 : Delete SD file", "content": "\n", "excerpt": "Delete a specified file from SD.", "link": "/docs/gcode/M030.html", "search_omit": "" } ,{ "title": "M31 : Print time", "content": "[“This command reports the time elapsed since the start of the current print job to the host. When printing from SD card, the print job timer starts as soon as SD printing starts.\\n\\nIf PRINTJOB_TIMER_AUTOSTART is enabled then the first M109 or M190 command received from the host will also start the print job timer.\\n\\nFor manual control from the host, use M75, M76, and M77 to start, pause, and stop the print job timer.\\n”]\n", "excerpt": "Report the current print time.", "link": "/docs/gcode/M031.html", "search_omit": "" } ,{ "title": "M32 : Select and Start", "content": "[“The M32 command exists to allow G-code to load other G-code files and run them as sub-programs. This can be useful to change the start / end gcode for a batch of files without having to edit them all.”, “For legacy reasons M32 uses ‘!’ (and ‘#’) to delimit the filepath parameter. The filepath must be the last parameter.”]\n", "excerpt": "Begin an SD print from a file.", "link": "/docs/gcode/M032.html", "search_omit": "" } ,{ "title": "M33 : Get Long Path", "content": "\n", "excerpt": "Convert a short pathname to a long pathname.", "link": "/docs/gcode/M033.html", "search_omit": "" } ,{ "title": "M34 : SDCard Sorting", "content": "[“Marlin now contains support for SDCard alphabetical file sorting in the LCD menus. This feature uses free SRAM to create a sorting index for up to the first 256 files in the current folder, and (if you have lots of SRAM) can optionally cache file listings for a more responsive UI. Buffering only occurs during file browsing. Otherwise the SRAM is freed.”]\n", "excerpt": "Set SDCard file sorting options.", "link": "/docs/gcode/M034.html", "search_omit": "" } ,{ "title": "M42 : Set Pin State", "content": "For custom hardware not officially supported in Marlin, you can often just connect up an unused pin and use M42 to control it.\n", "excerpt": "Set an analog or digital pin to a specified state.", "link": "/docs/gcode/M042.html", "search_omit": "" } ,{ "title": "M43 T : Toggle Pins", "content": "[“The M43 T command toggles one or more pins.”]\n", "excerpt": "Get information about pins.", "link": "/docs/gcode/M043-T.html", "search_omit": "" } ,{ "title": "M43 : Debug Pins", "content": "[“When setting up or debugging a machine it’s useful to know how pins are assigned to functions by the firmware, and to be able to find pins for use with new functions. M43 provides these tools. M43 by itself reports all pin assignments. Use P to specify a single pin. Use I to report the values on pins that are protected. Use W to watch the specified pin, or all pins. Use the E option to monitor endstops. Use S option to test a BLTouch type servo probe. Use T option to toggle pins.”, “The W watch mode option continues looping, blocking all further commands, until the board is reset. If EMERGENCY_PARSER is enabled, M108 may also be used to exit the watch loop without needing to reset the board.”, “See M43 T for Pins Debugging toggle options.”]\n", "excerpt": "Get information about pins.", "link": "/docs/gcode/M043.html", "search_omit": "" } ,{ "title": "M48 : Probe Accuracy Test", "content": "[“Probes come in many flavors and as such have varying levels of accuracy, reliability, and repeatability, depending on several factors. This command tests the probe for accuracy and produces a standard deviation based on two or more probes of the same XY position.”]\n", "excerpt": "Measure Z Probe repeatability.", "link": "/docs/gcode/M048.html", "search_omit": "" } ,{ "title": "M73 : Set Print Progress", "content": "[“Set current print progress percentage for LCD.”]\n", "excerpt": "Set current print progress percentage for LCD.", "link": "/docs/gcode/M073.html", "search_omit": "" } ,{ "title": "M75 : Start Print Job Timer", "content": "[“Start the print job timer.”]\n", "excerpt": "Start the print job timer.", "link": "/docs/gcode/M075.html", "search_omit": "" } ,{ "title": "M76 : Pause Print Job", "content": "[“Pause the print job timer.”]\n", "excerpt": "Pause the print job timer.", "link": "/docs/gcode/M076.html", "search_omit": "" } ,{ "title": "M77 : Stop Print Job Timer", "content": "[“Stop the print job timer.”]\n", "excerpt": "Stop the print job timer.", "link": "/docs/gcode/M077.html", "search_omit": "" } ,{ "title": "M78 : Print Job Stats", "content": "\n", "excerpt": "Print statistics about print jobs.", "link": "/docs/gcode/M078.html", "search_omit": "" } ,{ "title": "M80 : Power On", "content": "[“Turn on the high-voltage power supply. Requires a board that’s powered from USB or another 5V source.”]\n", "excerpt": "Turn on the power supply.", "link": "/docs/gcode/M080.html", "search_omit": "" } ,{ "title": "M81 : Power Off", "content": "[“Turn off the high-voltage power supply. If the board is not powered from another source, this may also shut down the electronics.”]\n", "excerpt": "Turn off the power supply.", "link": "/docs/gcode/M081.html", "search_omit": "" } ,{ "title": "M82 : E Absolute", "content": "[“This command is used to override G91 and put the E axis into absolute mode independent of the other axes.”]\n", "excerpt": "Set E to absolute positioning.", "link": "/docs/gcode/M082.html", "search_omit": "" } ,{ "title": "M83 : E Relative", "content": "[“This command is used to override G90 and put the E axis into relative mode independent of the other axes.”]\n", "excerpt": "Set E to relative positioning.", "link": "/docs/gcode/M083.html", "search_omit": "" } ,{ "title": "M85 : Inactivity Shutdown", "content": "[“Use this command to set a maximum period of time for the machine to be inactive (with no moves). If the machine is idle for longer than the set period, the firmware will shut everything down and halt the machine.”]\n", "excerpt": "Set the inactivity timeout.", "link": "/docs/gcode/M085.html", "search_omit": "" } ,{ "title": "M92 : Set Axis Steps-per-unit", "content": "[“Use M92 to set the steps-per-unit for one or more axes. This setting affects how many steps will be done for each unit of movement. Units will be in steps/mm unless inch mode is set with G20 (which requires INCH_MODE_SUPPORT).”]\n", "excerpt": "Set the number of steps-per-mm or steps-per-inch.", "link": "/docs/gcode/M092.html", "search_omit": "" } ,{ "title": "M100 : Free Memory", "content": "[“Use M100 for development purposes to observe how much memory (particularly stack) is being used by code. Proper AVR code should avoid use of new, malloc, etc., and instead use either pre-allocated static variables or stack.”]\n", "excerpt": "Description Here", "link": "/docs/gcode/M100.html", "search_omit": "" } ,{ "title": "M104 : Set Hotend Temperature", "content": "[“Set a new target hot end temperature and continue without waiting. The firmware will continue to try to reach and hold the temperature in the background.”, “Use M109 to wait for the hot end to reach the target temperature.”]\n", "excerpt": "Set a new target hot end temperature.", "link": "/docs/gcode/M104.html", "search_omit": "" } ,{ "title": "M105 : Report Temperatures", "content": "[“Request a temperature report to be sent to the host at some point in the future.”]\n", "excerpt": "Send a temperature report to the host.", "link": "/docs/gcode/M105.html", "search_omit": "" } ,{ "title": "M106 : Set Fan Speed", "content": "Turn on one of the fans and set its speed. If no fan index is given, the print cooling fan is selected. The fan speed applies to the next block added to the planner, so it will not take effect until previous moves in the planner are done. Under manual control with an idle machine, M106 will change the fan speed immediately.\n", "excerpt": "Turn on the fan and set its speed", "link": "/docs/gcode/M106.html", "search_omit": "" } ,{ "title": "M107 : Fan Off", "content": "Turn off one of the fans. If no fan index is given, the print cooling fan.\n", "excerpt": "Turn off a fan", "link": "/docs/gcode/M107.html", "search_omit": "" } ,{ "title": "M108 : Break and Continue", "content": "[“The M108 command requires EMERGENCY_PARSER for full effectiveness. (Otherwise a full queue blocks the parser.)\\n\\nSome G-code commands cause Marlin to go into a closed loop, waiting indefinitely for a certain state or event. For example, M109 waits for the target temperature to be reached, and M0 waits for an LCD click.\\n\\n- In the case of M109, the M108 command stops waiting for the target temperature and continues processing G-code. This may result in \"cold extrude\" messages. For a full stop use M112.\\n- In the case of M0 the M108 command acts like the LCD button, breaking out of M0 and continuing to process the G-code queue.\\n”]\n", "excerpt": "Break out of the current waiting loop", "link": "/docs/gcode/M108.html", "search_omit": "" } ,{ "title": "M109 : Wait for Hotend Temperature", "content": "[“This command optionally sets a new target hot end temperature and waits for the target temperature to be reached before proceeding. If the temperature is set with S then M109 waits only when heating. If the temperature is set with R then M109 will also wait for the temperature to go down.”]\n", "excerpt": "Wait for the hot end to reach its target.", "link": "/docs/gcode/M109.html", "search_omit": "" } ,{ "title": "M110 : Set Line Number", "content": "Hosts can use M110 to set the current line number in a print job. Each line number sent by a host must be one higher than the previous line number, or the firmware will ignore the line and send an error requesting a resend of the missing line. This is one technique Marlin uses to keep in sync with hosts.\n", "excerpt": "Set the current line number.", "link": "/docs/gcode/M110.html", "search_omit": "" } ,{ "title": "M111 : Debug Level", "content": "Marlin has several debug bits that can be set, in combination, to help configure, troubleshoot, and debug the firmware. Add up the debug bits you need:\n\n\n \n \n Mask\n Name\n Description\n \n \n 1\n ECHO\n Echo all commands sent to the parser.\n \n \n 2\n INFO\n Print extra informational messages.\n \n \n 4\n ERRORS\n Print extra error messages.\n \n \n 8\n DRYRUN\n Don’t extrude, don’t save leveling data, etc.\n \n \n 16\n COMMUNICATION\n Not currently used.\n \n \n 32\n LEVELING\n Detailed messages for homing, probing, and leveling. (Requires DEBUG_LEVELING_FEATURE.)\n \n \n 64\n Reserved\n Reserved for future usage\n \n \n 128\n Reserved\n Reserved for future usage\n \n \n\n", "excerpt": "Report and optionally set the debug flags.", "link": "/docs/gcode/M111.html", "search_omit": "" } ,{ "title": "M112 : Emergency Stop", "content": "Used for emergency stopping, M112 shuts down the machine, turns off all the steppers and heaters, and if possible, turns off the power supply. A reset is required to return to operational mode.\n", "excerpt": "Shut everything down and halt the machine.", "link": "/docs/gcode/M112.html", "search_omit": "" } ,{ "title": "M113 : Host Keepalive", "content": "During some lengthy processes, such as G29, Marlin may appear to the host to have “gone away.” The “host keepalive” feature will send messages to the host when Marlin is busy or waiting for user response so the host won’t try to reconnect.\n", "excerpt": "Get or set the host keepalive interval.", "link": "/docs/gcode/M113.html", "search_omit": "" } ,{ "title": "M114 : Get Current Position", "content": "Get the current position of the active nozzle. Includes stepper values.\nIf M114_DETAIL is enabled the D parameter will provide more details such as leveling information and kinematics.\n", "excerpt": "Report the current tool position to the host.", "link": "/docs/gcode/M114.html", "search_omit": "" } ,{ "title": "M115 : Firmware Info", "content": "This command causes Marlin to output a string like this:\n\nFIRMWARE_NAME:Marlin 1.1.0 (Github) SOURCE_CODE_URL:https://github.com/MarlinFirmware/Marlin PROTOCOL_VERSION:1.0 MACHINE_TYPE:RepRap EXTRUDER_COUNT:1 UUID:cede2a2f-41a2-4748-9b12-c55c62f367ff\n\n\n\nWhen EXTENDED_CAPABILITIES_REPORT is enabled, Marlin also reports its capabilities:\n\nCap:EEPROM:1\nCap:AUTOREPORT_TEMP:1\nCap:PROGRESS:0\nCap:AUTOLEVEL:1\nCap:Z_PROBE:1\nCap:SOFTWARE_POWER:0\nCap:TOGGLE_LIGHTS:0\nCap:EMERGENCY_PARSER:1\n\n\n\nHosts use this information to improve interoperability, so it’s a good feature to enable.\n", "excerpt": "Print the firmware info and capabilities.", "link": "/docs/gcode/M115.html", "search_omit": "" } ,{ "title": "M117 : Set LCD Message", "content": "Set the status line message on the LCD.\n", "excerpt": "Set the message line on the LCD.", "link": "/docs/gcode/M117.html", "search_omit": "" } ,{ "title": "M118 : Serial print", "content": "Send a message to the connected host for display in the host console or to perform a host action.\n", "excerpt": "Send text to serial", "link": "/docs/gcode/M118.html", "search_omit": "" } ,{ "title": "M119 : Endstop States", "content": "[“Use this command to get the current state of all endstops, useful for setup and troubleshooting. Endstops are reported as either \"open\" or \"TRIGGERED\".”, “The state of the Z probe and filament runout sensors are also reported with this command.”]\n", "excerpt": "Report endstop and probe states to the host.", "link": "/docs/gcode/M119.html", "search_omit": "" } ,{ "title": "M120 : Enable Endstops", "content": "Enable endstops.\n", "excerpt": "Enable endstops and keep them enabled when not homing.", "link": "/docs/gcode/M120.html", "search_omit": "" } ,{ "title": "M121 : Disable Endstops", "content": "Disable endstops.\n", "excerpt": "Disable endstops and keep them enabled when not homing.", "link": "/docs/gcode/M121.html", "search_omit": "" } ,{ "title": "M122 : TMC Debugging", "content": "[“Do a communication check for configured TMC drivers.”, “With no parameters, this command returns the current settings for all installed Trinamic TMC2130 and TMC2208 stepper motor drivers. The S[0|1] parameter enables/disables continuous debugging output.”]\n", "excerpt": "Get TMC Debug Info", "link": "/docs/gcode/M122.html", "search_omit": "" } ,{ "title": "M125 : Park Head", "content": "Save the current nozzle position and move to the configured park position.\n", "excerpt": "Save current position and move to filament change position.", "link": "/docs/gcode/M125.html", "search_omit": "" } ,{ "title": "M126 : Baricuda 1 Open", "content": "Open the valve for Baricuda paste extruder 1.\n", "excerpt": "Open the valve for Baricuda 1.", "link": "/docs/gcode/M126.html", "search_omit": "" } ,{ "title": "M127 : Baricuda 1 Close", "content": "Close the valve for Baricuda paste extruder 1.\n", "excerpt": "Close the valve for Baricuda 1.", "link": "/docs/gcode/M127.html", "search_omit": "" } ,{ "title": "M128 : Baricuda 2 Open", "content": "Open the valve for Baricuda paste extruder 2.\n", "excerpt": "Open the valve for Baricuda 2.", "link": "/docs/gcode/M128.html", "search_omit": "" } ,{ "title": "M129 : Baricuda 2 Close", "content": "Close the valve for Baricuda paste extruder 2.\n", "excerpt": "Close the valve for Baricuda 2.", "link": "/docs/gcode/M129.html", "search_omit": "" } ,{ "title": "M140 : Set Bed Temperature", "content": "[“Set a new target heated bed temperature and continue without waiting. The firmware will continue to try to reach and hold the temperature in the background.”, “Use M190 to wait for the bed to reach the target temperature.”]\n", "excerpt": "Set a new target bed temperature.", "link": "/docs/gcode/M140.html", "search_omit": "" } ,{ "title": "M141 : Set Chamber Temperature", "content": "[“Set a new target heated chamber temperature and continue without waiting. The firmware will continue to try to reach and hold the temperature in the background.”]\n", "excerpt": "Set a new target chamber temperature.", "link": "/docs/gcode/M141.html", "search_omit": "" } ,{ "title": "M145 : Set Material Preset", "content": "Set the preheating presets for materials in the LCD menu.\n", "excerpt": "Set material presets in the LCD menu.", "link": "/docs/gcode/M145.html", "search_omit": "" } ,{ "title": "M149 : Set Temperature Units", "content": "Set temperature units to Celsius, Fahrenheit, or Kelvin. Celsius is the default.\n", "excerpt": "Set temperature units to Celsius, Fahrenheit, or Kelvin.", "link": "/docs/gcode/M149.html", "search_omit": "" } ,{ "title": "M150 : Set RGB(W) Color", "content": "If you have an RGB(W) light, either as part of a controller or installed separately, the M150 command can be used to set its color.\n", "excerpt": "Set the color of the RGB(W) LED, backlight, or LED strip.", "link": "/docs/gcode/M150.html", "search_omit": "" } ,{ "title": "M155 : Temperature Auto-Report", "content": "It can be useful for host software to track temperatures, display and graph them over time, but polling with M105 is less than optimal. With M155 hosts simply set an interval and Marlin will keep sending data automatically. This method is preferred over polling with M105.\n", "excerpt": "Auto-report temperatures to host periodically.", "link": "/docs/gcode/M155.html", "search_omit": "" } ,{ "title": "M163 : Set Mix Factor", "content": "Set a single mix factor (in proportion to the sum total of all mix factors). The mix must be committed to a virtual tool by M164 before it takes effect.\n", "excerpt": "Set a single mix factor for a mixing extruder.", "link": "/docs/gcode/M163.html", "search_omit": "" } ,{ "title": "M164 : Save Mix", "content": "\n", "excerpt": "Save the current mix as a virtual tool.", "link": "/docs/gcode/M164.html", "search_omit": "" } ,{ "title": "M165 : Set Mix", "content": "Set the mix for the active virtual extruder all at once. Any factors left out are set to 0.0. This is based on a reference implementation by Pìa Taubert.\n", "excerpt": "Set all mix factors for the mixing extruder.", "link": "/docs/gcode/M165.html", "search_omit": "" } ,{ "title": "M166 : Gradient Mix", "content": "Use M166 to set a gradient that will be automatically updated as the Z position changes during a print. The gradient smoothly transitions from one virtual tool to another between the given starting and ending Z heights. Below the starting height the starting virtual tool fully applies, and above the ending height the ending virtual tool fully applies.\n", "excerpt": "Set a Gradient Mix", "link": "/docs/gcode/M166.html", "search_omit": "" } ,{ "title": "M190 : Wait for Bed Temperature", "content": "[“This command optionally sets a new target bed temperature and waits for the target temperature to be reached before proceeding. If the temperature is set with S then it waits only when heating.”]\n", "excerpt": "Wait for the bed to reach target temperature.", "link": "/docs/gcode/M190.html", "search_omit": "" } ,{ "title": "M200 : Set Filament Diameter", "content": "[“Set the filament’s current diameter and enable volumetric extrusion.”, “In volumetric extrusion mode the E axis specifies cubic mm instead of linear mm, and the firmware calculates how much length to extrude for the given volume based on the filament diameter.”]\n", "excerpt": "Set the diameter for volumetric extrusion.", "link": "/docs/gcode/M200.html", "search_omit": "" } ,{ "title": "M201 : Set Print Max Acceleration", "content": "Set the max acceleration for one or more axes (in current units-per-second squared).\n", "excerpt": "Set maximum acceleration for print moves one or more axes.", "link": "/docs/gcode/M201.html", "search_omit": "" } ,{ "title": "M203 : Set Max Feedrate", "content": "Set the max feedrate for one or more axes (in current units-per-second).\n", "excerpt": "Set maximum feedrate for one or more axes.", "link": "/docs/gcode/M203.html", "search_omit": "" } ,{ "title": "M204 : Set Starting Acceleration", "content": "Set the preferred starting acceleration for moves of different types.\n", "excerpt": "Set the starting acceleration for moves by type.", "link": "/docs/gcode/M204.html", "search_omit": "" } ,{ "title": "M205 : Set Advanced Settings", "content": "Set various motion settings. See parameters for details.\n", "excerpt": "Set some advanced settings related to movement.", "link": "/docs/gcode/M205.html", "search_omit": "" } ,{ "title": "M206 : Set Home Offsets", "content": "Use M206 to apply a persistent offset to the native home position and coordinate space. This effectively shifts the coordinate space in the negative direction. See examples below.\n\n\n The current position is adjusted to align to the new home offset values.\n The home offset is persistent — added to the current position until changed.\n Some uses include fine adjustment of Z position (without moving endstops) and shifting the coordinate space to print on a different part of the bed.\n\n", "excerpt": "Description Here", "link": "/docs/gcode/M206.html", "search_omit": "" } ,{ "title": "M207 : Set Firmware Retraction", "content": "Set lengths, feedrate, and Z lift for firmware-based retraction. See parameters below.\n", "excerpt": "Set options for firmware-based retraction.", "link": "/docs/gcode/M207.html", "search_omit": "" } ,{ "title": "M208 : Firmware Recover", "content": "[“Set the added lengths and feedrates for firmware-based retract recovery. The lengths set by M208 are applied in addition to the lengths set by M207 when un-retracting (aka \"recovering\") the filament. The new values will apply to all subsequent G11 commands.”, “The \"swap\" values apply to firmware-based recover moves after a tool-change.”]\n", "excerpt": "Firmware-retraction recover settings.", "link": "/docs/gcode/M208.html", "search_omit": "" } ,{ "title": "M209 : Set Auto Retract", "content": "[“Enable or disable automatic retraction. This option is meant to help slicers that don’t support G10/G11. But it can be used to override retraction in any GCode.”, “When auto-retract is enabled, all reversed E-only moves are treated as retraction. (Recover moves are also automatically overridden.) When disabled, E retraction derives from G-code.”]\n", "excerpt": "Enable / disable auto-retraction.", "link": "/docs/gcode/M209.html", "search_omit": "" } ,{ "title": "M211 : Software Endstops", "content": "[“Optionally enable/disable software endstops, then report the current state.”, “With software endstops enabled, moves will be clipped to the physical boundaries from [XYZ]_MIN_POS to [XYZ]_MAX_POS.”]\n", "excerpt": "Set and/or get the software endstops state", "link": "/docs/gcode/M211.html", "search_omit": "" } ,{ "title": "M217 : Filament swap parameters", "content": "[“When changing tools on some setups, one filament may be retracted before the other is primed. This command sets the length and feedrates used for the filament swap retract and prime.”, “If no parameters are given this command reports the current filament swap parameters.”]\n", "excerpt": "Set length and speed for filament swapping", "link": "/docs/gcode/M217.html", "search_omit": "" } ,{ "title": "M218 : Set Hotend Offset", "content": "[“To keep nozzles aligned to the work area between tool-changes, the firmware needs to know how they relate to each other.”]\n", "excerpt": "Set the offset of a hotend (from hotend 0).", "link": "/docs/gcode/M218.html", "search_omit": "" } ,{ "title": "M220 : Set Feedrate Percentage", "content": "Set the feedrate percentage, which applies to all G-code-based moves in all (X, Y, Z, and E) axes.\n", "excerpt": "Set the global feedrate percentage.", "link": "/docs/gcode/M220.html", "search_omit": "" } ,{ "title": "M221 : Set Flow Percentage", "content": "Set the flow percentage, which applies to all E moves added to the planner.\n", "excerpt": "Set the flow percentage, which applies to all E moves.", "link": "/docs/gcode/M221.html", "search_omit": "" } ,{ "title": "M226 : Wait for Pin State", "content": "Wait for a pin to have a certain value or state.\n", "excerpt": "Wait for a pin to have a given state.", "link": "/docs/gcode/M226.html", "search_omit": "" } ,{ "title": "M240 : Trigger Camera", "content": "Trigger a camera shutter using a digital pin or by bumping a physical switch.\n", "excerpt": "Trigger a camera shutter", "link": "/docs/gcode/M240.html", "search_omit": "" } ,{ "title": "M250 : LCD Contrast", "content": "Set and/or get the LCD contrast. The value is constrained based on the LCD.\n", "excerpt": "Set and/or get the LCD contrast.", "link": "/docs/gcode/M250.html", "search_omit": "" } ,{ "title": "M260 : I2C Send", "content": "Utility to send data over the I2C bus.\n", "excerpt": "Send data to the I2C bus.", "link": "/docs/gcode/M260.html", "search_omit": "" } ,{ "title": "M261 : I2C Request", "content": "Request bytes from the I2C bus and echo them to the host. To find out how to do more useful things with I2C see the I2C master / slave article.\n", "excerpt": "Request and echo bytes from the I2C bus.", "link": "/docs/gcode/M261.html", "search_omit": "" } ,{ "title": "M280 : Servo Position", "content": "Set or get the position of a servo.\n", "excerpt": "Set or get a servo position.", "link": "/docs/gcode/M280.html", "search_omit": "" } ,{ "title": "M290 : Babystep", "content": "[“Apply babysteps to one or more axes using current units. Offsets applied with M290 aren’t added to the current coordinates, but are intended for making small adjustments, especially in the Z axis, at the start of a print.”, “Note that when BABYSTEP_ZPROBE_OFFSET is enabled, M290 also modifies the Probe Z Offset (with no immediate effects). The new Z offset applies to successive probing operations, and can be saved with M500. This behavior is means to coincide with the LCD Menu replacing \"Z Babystepping\" with \"Babystep Z Probe Offset.\" To avoid this side-effect, use M290 P0 or leave BABYSTEP_ZPROBE_OFFSET disabled.”]\n", "excerpt": "Babystep one or more axes", "link": "/docs/gcode/M290.html", "search_omit": "" } ,{ "title": "M300 : Play Tone", "content": "Add a tone to the tone queue.\n", "excerpt": "Play a single tone, buzz, or beep.", "link": "/docs/gcode/M300.html", "search_omit": "" } ,{ "title": "M301 : Set Hotend PID", "content": "Set the values that control the PID loop for a hotend.\n", "excerpt": "Set PID values for a hotend.", "link": "/docs/gcode/M301.html", "search_omit": "" } ,{ "title": "M302 : Cold Extrude", "content": "Set the minimum extrusion temperature, potentially allowing E movement at temperatures below the melting point of the material.\n", "excerpt": "Set minimum extrusion temperature, allow cold extrusion.", "link": "/docs/gcode/M302.html", "search_omit": "" } ,{ "title": "M303 : PID autotune", "content": "This command initiates a process of heating and cooling to determine the proper PID values for the specified hotend or the heated bed.\n", "excerpt": "Auto-tune the PID system to find stable values.", "link": "/docs/gcode/M303.html", "search_omit": "" } ,{ "title": "M304 : Set Bed PID", "content": "Set the values that control the PID loop for the heated bed.\n", "excerpt": "Set PID values for the heated bed.", "link": "/docs/gcode/M304.html", "search_omit": "" } ,{ "title": "M350 : Set micro-stepping", "content": "If your board has digital micro-stepping pins (X_MS1, Y_MS1, etc.), use this command to set the micro-steps.\n", "excerpt": "Set micro-stepping for drivers that support it", "link": "/docs/gcode/M350.html", "search_omit": "" } ,{ "title": "M351 : Set Microstep Pins", "content": "If your board has digital micro-stepping pins (X_MS1, Y_MS1, etc.), use this command to set the micro-steps.\n", "excerpt": "Directly set the micro-stepping pins", "link": "/docs/gcode/M351.html", "search_omit": "" } ,{ "title": "M355 : Case Light Control", "content": "Set the case light power state and/or brightness.\n", "excerpt": "Turn the case light on or off, set brightness", "link": "/docs/gcode/M355.html", "search_omit": "" } ,{ "title": "M360 : SCARA Theta A", "content": "Move the nozzle to SCARA calibration position Theta 0 (A0 B120) for calibration of “zero degrees.”\n", "excerpt": "Move to Theta A", "link": "/docs/gcode/M360.html", "search_omit": "" } ,{ "title": "M361 : SCARA Theta-B", "content": "Move the nozzle to SCARA Theta-B calibration position Theta 90 (A90 B130) for calibration of “90 degrees steps-per-degree.”\n", "excerpt": "Move to Theta-B", "link": "/docs/gcode/M361.html", "search_omit": "" } ,{ "title": "M362 : SCARA Psi-A", "content": "Move the nozzle to SCARA Psi-A calibration position Psi 0 (A60 B180) for calibration of “zero degrees.”\n", "excerpt": "Move to Psi-A", "link": "/docs/gcode/M362.html", "search_omit": "" } ,{ "title": "M363 : SCARA Psi-B", "content": "Move the nozzle to SCARA Psi-B calibration position Psi 90 (A50 B90) for calibration of “90 degrees steps-per-degree.”\n", "excerpt": "Move to Psi-B", "link": "/docs/gcode/M363.html", "search_omit": "" } ,{ "title": "M364 : SCARA Psi-C", "content": "Move the nozzle to SCARA Psi-C calibration position Theta-Psi 90 (A45 B135) for calibration of “90 degrees to Theta.”\n", "excerpt": "Move to Psi-C", "link": "/docs/gcode/M364.html", "search_omit": "" } ,{ "title": "M380 : Activate Solenoid", "content": "Activate the solenoid on the active extruder.\n", "excerpt": "Activate", "link": "/docs/gcode/M380.html", "search_omit": "" } ,{ "title": "M381 : Deactivate Solenoids", "content": "Deactivate all solenoids on all extruders.\n", "excerpt": "Deactivate all extruder solenoids", "link": "/docs/gcode/M381.html", "search_omit": "" } ,{ "title": "M400 : Finish Moves", "content": "This command causes all GCode processing to pause and wait in a loop until all moves in the planner are completed.\n", "excerpt": "Wait for all moves to finish", "link": "/docs/gcode/M400.html", "search_omit": "" } ,{ "title": "M401 : Deploy Probe", "content": "Deploy the bed probe. The Z axis may raise up to make room for the probe to deploy.\n", "excerpt": "Deploy the bed probe", "link": "/docs/gcode/M401.html", "search_omit": "" } ,{ "title": "M402 : Stow Probe", "content": "Stow the bed probe. The Z axis may raise up to make room for the probe to stow.\n", "excerpt": "Stow the bed probe", "link": "/docs/gcode/M402.html", "search_omit": "" } ,{ "title": "M403 : MMU2 Filament Type", "content": "Set the filament type for a Prusa MMU2 (or compatible) material slot.\n", "excerpt": "Set filament type for Multi-Material Unit 2.0", "link": "/docs/gcode/M403.html", "search_omit": "" } ,{ "title": "M404 : Set Filament Diameter", "content": "Report or set the nominal filament width, such as 1.75 or 3.00.\n\nThis value is used to determine the percentage difference when auto-adjusting flow in response to the measured filament width, and should match the value used for filament width in your slicer settings.\n", "excerpt": "Set the nominal diameter for filament width sensor auto-flow", "link": "/docs/gcode/M404.html", "search_omit": "" } ,{ "title": "M405 : Filament Width Sensor On", "content": "Turn on the filament width sensor and start using it to do flow control. Initially, the filament between the sensor and the hot-end will be treated as the nominal width.\n", "excerpt": "Enable filament width sensor flow control", "link": "/docs/gcode/M405.html", "search_omit": "" } ,{ "title": "M406 : Filament Width Sensor Off", "content": "Turn off the filament width sensor and stop using it to do flow control.\n", "excerpt": "Disable filament width sensor flow control", "link": "/docs/gcode/M406.html", "search_omit": "" } ,{ "title": "M407 : Filament Width", "content": "Report the current measured filament width to the host.\n", "excerpt": "Report the measured filament width", "link": "/docs/gcode/M407.html", "search_omit": "" } ,{ "title": "M410 : Quickstop", "content": "Stop all steppers instantly. Since there will be no deceleration, steppers are expected to be out of position after this command.\n", "excerpt": "Stop all steppers instantly", "link": "/docs/gcode/M410.html", "search_omit": "" } ,{ "title": "M412 : Filament Runout", "content": "Enable or disable filament runout detection. When filament sensors are enabled, Marlin will respond to a filament runout by running the configured G-code (usually M600 Filament Change). When filament runout detection is disabled, Marlin will take no action for filament runout.\n", "excerpt": "Enable / disable filament runout detection", "link": "/docs/gcode/M412.html", "search_omit": "" } ,{ "title": "M413 : Power-loss Recovery", "content": "Enable or disable the Power-loss Recovery feature. When this feature is enabled, the state of the current print job (SD card only) will be saved to a file on the SD card. If the machine crashes or a power outage occurs, the firmware will present an option to Resume the interrupted print job. In Marlin 2.0 the POWER_LOSS_RECOVERY option must be enabled.\n\nThis feature operates without a power-loss detection circuit by writing to the recovery file periodically (e.g., once per layer), or if a POWER_LOSS_PIN is configured then it will write the recovery info only when a power-loss is detected. The latter option is preferred, since constant writing to the SD card can shorten its life, and the print will be resumed where it was interrupted rather than repeating the last layer. (Future implementations may allow use of the EEPROM or the on-board SD card.)\n", "excerpt": "Enable / disable power-loss recovery", "link": "/docs/gcode/M413.html", "search_omit": "" } ,{ "title": "M420 : Bed Leveling State", "content": "[“Get and/or set the enabled state of bed leveling compensation, plus Z fade height.”, “This command has been extended with L to load a mesh for Unified Bed Leveling.”]\n", "excerpt": "Get and/or set bed leveling state and fade height", "link": "/docs/gcode/M420.html", "search_omit": "" } ,{ "title": "M421 : Set Mesh Value", "content": "[“This command is used to set a single Z value for a mesh point in the stored bed leveling data.”, “Allowed forms are M421 In Jn Zn, M421 Xn Yn Zn (MESH_BED_LEVELING only) or M421 C Zn (AUTO_BED_LEVELING_UBL only).”]\n", "excerpt": "Set a single mesh Z height", "link": "/docs/gcode/M421.html", "search_omit": "" } ,{ "title": "M425 : Backlash compensation", "content": "[“Backlash compensation will add extra steps to one or more segments whenever a motor reverses direction.”, “By default, steps are added to the first segment after a direction change. This gives the best dimensional accuracy but may cause marks to appear in the print. Smoothing spreads the added steps over multiple consecutive segments to prevent blemishes in the print, at the expense of dimensional accuracy.”, “Backlash compensation can be configured at either compile-time or run-time. Enable BACKLASH_GCODE to turn on M425 and a \"Backlash\" menu item.”, “Backlash can be measured automatically on all axes with G425 or on Z only with G29 when MEASURE_BACKLASH_WHEN_PROBING is enabled.”]\n", "excerpt": "Enable and tune backlash compensation", "link": "/docs/gcode/M425.html", "search_omit": "" } ,{ "title": "M428 : Home Offsets Here", "content": "Use M428 to set a persistent offset to the native home position and coordinate space by assigning the current position as the native home position. See the example below.\n\n\n The current position must be within 2cm from 0 or an endstop.\n The current position is set to the native home position.\n Any previous position shift from G92 is cleared.\n The home offset is persistent — added to the current position until changed.\n Some uses include fine adjustment of Z position (without moving endstops) and shifting the coordinate space to print on a different part of the bed.\n\n", "excerpt": "Set home offsets based on current position", "link": "/docs/gcode/M428.html", "search_omit": "" } ,{ "title": "M500 : Save Settings", "content": "Save all configurable settings to EEPROM.\n", "excerpt": "Save settings to EEPROM.", "link": "/docs/gcode/M500.html", "search_omit": "" } ,{ "title": "M501 : Restore Settings", "content": "Load all saved settings from EEPROM.\n", "excerpt": "Restore settings from EEPROM.", "link": "/docs/gcode/M501.html", "search_omit": "" } ,{ "title": "M502 : Factory Reset", "content": "[“Reset all configurable settings to their factory defaults.”, “To also reset settings in EEPROM, follow with M500.”]\n", "excerpt": "Restore all settings to factory defaults.", "link": "/docs/gcode/M502.html", "search_omit": "" } ,{ "title": "M503 : Report Settings", "content": "Print a concise report of all current settings (in SRAM) to the host console.\n", "excerpt": "Report all settings that may be saved to EEPROM.", "link": "/docs/gcode/M503.html", "search_omit": "" } ,{ "title": "M504 : Validate EEPROM contents", "content": "Validate the contents of the EEPROM.\n", "excerpt": "Validate the contents of the EEPROM.", "link": "/docs/gcode/M504.html", "search_omit": "" } ,{ "title": "M524 : Abort SD print", "content": "Abort an SD print in progress and turn off all heaters.\n", "excerpt": "Abort an SD print started with `M24`", "link": "/docs/gcode/M524.html", "search_omit": "" } ,{ "title": "M540 : Endstops Abort SD", "content": "Set whether SD printing should abort in the event of any endstop being triggered. This provides a fast way to abort a print in the event of mechanical failure such as loose couplings, lost steps, diverted axes, binding, etc., which lead to axes being very far out of position.\n", "excerpt": "Abort SD printing when an endstop is triggered.", "link": "/docs/gcode/M540.html", "search_omit": "" } ,{ "title": "M569 : Set TMC stepping mode", "content": "Toggle between stealthChop and spreadCycle on supporting TMC drivers.\n", "excerpt": "Toggle stealthChop", "link": "/docs/gcode/M569.html", "search_omit": "" } ,{ "title": "M600 : Filament Change", "content": "[“The M600 command initiates the filament change procedure. The basic procedure will move the print head away from the print, eject the filament, wait for new filament to be inserted and the user to confirm, load and prime the filament, and continue with the print. M600 may be initiated automatically if a filament runout sensor is installed.”]\n", "excerpt": "Automatically change filament", "link": "/docs/gcode/M600.html", "search_omit": "" } ,{ "title": "M603 : Configure Filament Change", "content": "[“The M603 command configures automatic filament change parameters.”]\n", "excerpt": "Configure automatic filament change parameters", "link": "/docs/gcode/M603.html", "search_omit": "" } ,{ "title": "M605 : Dual Nozzle Mode", "content": "[“This command behaves differently for DUAL_X_CARRIAGE vs. DUAL_NOZZLE_DUPLICATION_MODE”, “For DUAL_NOZZLE_DUPLICATION_MODE the S2 parameter enables duplication mode. Any other value disables it.”, “For DUAL_X_CARRIAGE, this command sets the Dual X mode. See the description of S below.”]\n", "excerpt": "Set the behavior mode for dual nozzles", "link": "/docs/gcode/M605.html", "search_omit": "" } ,{ "title": "M665 : SCARA Configuration", "content": "[“Configure SCARA geometry values”]\n", "excerpt": "Set SCARA geometry values", "link": "/docs/gcode/M665-scara.html", "search_omit": "" } ,{ "title": "M665 : Delta Configuration", "content": "[“Delta machines are very fast and accurate when tuned. The first key is to make sure all your dimensions are set correctly. Even small errors in these values can lead to curved movements and failed prints. To ensure the best delta experience, use this command in conjunction with G33 to get these dimensions set perfectly before beginning to print.”]\n", "excerpt": "Set delta geometry values", "link": "/docs/gcode/M665.html", "search_omit": "" } ,{ "title": "M666 : Set dual endstop offsets", "content": "The M666 command allows adjusting the offsets for dual endstops\n", "excerpt": "Set dual endstop offsets", "link": "/docs/gcode/M666-dual.html", "search_omit": "" } ,{ "title": "M666 : Set Delta endstop adjustments", "content": "The M666 command allows adjusting the endstops on a Delta printer.\n", "excerpt": "Set Delta endstop adjustments", "link": "/docs/gcode/M666.html", "search_omit": "" } ,{ "title": "M701 : Load filament", "content": "Load filament into the active extruder. By default this will use the configured ADVANCED_PAUSE_FEATURE settings.\n", "excerpt": "Load filament", "link": "/docs/gcode/M701.html", "search_omit": "" } ,{ "title": "M702 : Unload filament", "content": "Unload filament. By default this command will use the configured ADVANCED_PAUSE_FEATURE settings.\n", "excerpt": "Unload filament", "link": "/docs/gcode/M702.html", "search_omit": "" } ,{ "title": "M7219 : MAX7219 Control", "content": "Set the state of one or more Max7219 matrix displays or 7-segment digital displays.\n", "excerpt": "Control Max7219 Segmented LEDs", "link": "/docs/gcode/M7219.html", "search_omit": "" } ,{ "title": "M851 : Z Probe Offset", "content": "[“Set the vertical distance from the nozzle to the Z probe trigger-point.”, “The easiest way to get the value is to:\\n- Home the Z axis.\\n- Raise Z and deploy the probe.\\n- Move Z down slowly until the probe triggers.\\n- Take the current Z value and negate it. (5.2 =&gt; -5.2)\\n- Set with M851 Z-5.2 and #define Z_PROBE_OFFSET_FROM_EXTRUDER -5.2.\\n”]\n", "excerpt": "Set the Z probe Z offset from nozzle", "link": "/docs/gcode/M851.html", "search_omit": "" } ,{ "title": "M852 : Bed Skew Compensation", "content": "[“Bed Skew Compensation corrects for misalignment in the XY, XZ, and ZY axes through the use of correction factors.”]\n", "excerpt": "Misalignment in the XYZ axes.", "link": "/docs/gcode/M852.html", "search_omit": "" } ,{ "title": "M900 : Linear Advance Factor", "content": "Get and/or set the Linear Advance K factor.\n", "excerpt": "Get and set Linear Advance K value", "link": "/docs/gcode/M900.html", "search_omit": "" } ,{ "title": "M906 : TMC Motor Current", "content": "Set the current for a stepper motor in milliamps units.\n", "excerpt": "Set the motor current (in milliamps)", "link": "/docs/gcode/M906.html", "search_omit": "" } ,{ "title": "M907 : Set Motor Current", "content": "Set digital trimpot motor current using axis codes X, Y, Z, E, plus B and S. The unit used for current depends on the type of stepper driver.\n", "excerpt": "Set motor current via digital trimpot", "link": "/docs/gcode/M907.html", "search_omit": "" } ,{ "title": "M908 : Set Trimpot Pins", "content": "Set the digital trimpot current directly by address/channel/pin index. DAC_STEPPER_CURRENT pertains to the MCP4728.\n", "excerpt": "Set a digital trimpot directly", "link": "/docs/gcode/M908.html", "search_omit": "" } ,{ "title": "M909 : DAC Print Values", "content": "Print the DAC stepper current values in the format “% (Amps)”.\n", "excerpt": "Report DAC current values to host", "link": "/docs/gcode/M909.html", "search_omit": "" } ,{ "title": "M910 : Commit DAC to EEPROM", "content": "Commit digipot/DAC value to external EEPROM via I2C.\n", "excerpt": "Commit digipot/DAC value to external EEPROM", "link": "/docs/gcode/M910.html", "search_omit": "" } ,{ "title": "M911 : TMC OT Pre-Warn Condition", "content": "Report the TMC stepper driver overtemperature pre-warn condition to the host.\n", "excerpt": "Driver overtemperature pre-warn condition", "link": "/docs/gcode/M911.html", "search_omit": "" } ,{ "title": "M912 : Clear TMC OT Pre-Warn", "content": "Clear the stepper driver overtemperature pre-warn condition flag.\n", "excerpt": "Clear overtemperature pre-warn condition flag", "link": "/docs/gcode/M912.html", "search_omit": "" } ,{ "title": "M913 : Set Hybrid Threshold Speed", "content": "[“When HYBRID_THRESHOLD is enabled, the TMC driver is switched from the quieter StealthChop to spreadCycle when the feed rate for a given stepper motor is over its _HYBRID_THRESHOLD.”, “### Individual Threshold Values\\n- X_HYBRID_THRESHOLD\\n- X2_HYBRID_THRESHOLD\\n- Y_HYBRID_THRESHOLD\\n- Y2_HYBRID_THRESHOLD\\n- Z_HYBRID_THRESHOLD\\n- Z2_HYBRID_THRESHOLD\\n- E0_HYBRID_THRESHOLD\\n- E1_HYBRID_THRESHOLD\\n- E2_HYBRID_THRESHOLD\\n- E3_HYBRID_THRESHOLD\\n- E4_HYBRID_THRESHOLD\\n”]\n", "excerpt": "TMC driver switching to spreadCycle", "link": "/docs/gcode/M913.html", "search_omit": "" } ,{ "title": "M914 : TMC Bump Sensitivity", "content": "Some TMC stepper drivers can detect when they bump into something that causes them to stop moving. This feature is so sensitive that it can actually take the place of traditional endstops. Use this command to set the bump sensitivity for the X, Y, and Z stepper drivers.\n", "excerpt": "Set sensorless homing sensitivity", "link": "/docs/gcode/M914.html", "search_omit": "" } ,{ "title": "M915 : TMC Z axis calibration", "content": "The command aims to align the ends of the X gantry (for a Průša i3-style printer). Here’s a video demonstration.\n\nUsing the given current, Marlin will move the Z axis (at homing speed) to the top plus a given extra distance. Since this intentionally stalls the Z steppers, you should use the minimum current required to move the axis.\n\nZ is then re-homed to correct the position.\n", "excerpt": "Align ends of the Z axis and test torque", "link": "/docs/gcode/M915.html", "search_omit": "" } ,{ "title": "M928 : Start SD Logging", "content": "Use this command to start logging all console and host input to an SD file while still operating the machine.\n", "excerpt": "Log serial input to an SD file", "link": "/docs/gcode/M928.html", "search_omit": "" } ,{ "title": "M999 : STOP Restart", "content": "If a STOP occurs you can use M999 to restart the “stopped” machine after resolving the issue.\n\nMarlin will call STOP if any error occurs that would make continuing the current process problematic. For example, if the probe fails to deploy, it will abort probing and STOP. Note that this disables all heaters.\n", "excerpt": "Return the machine to Running state", "link": "/docs/gcode/M999.html", "search_omit": "" } ]